## Plan Result (user-api-cdk-production)

[CI link](https://github.com/Pocket/pocket-monorepo/actions/runs/11222018122)



<pre><code>Plan: 1 to add, 3 to change, 0 to destroy.</code></pre>

* Create
  * aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4
* Update
  * aws_appautoscaling_target.application_autoscaling_autoscaling_target_42BF5C99
  * aws_iam_policy.application_ecs_service_ecs-iam_ecs-task-execution-role-policy_2D469A77
  * aws_iam_policy.application_ecs_service_ecs-iam_ecs-task-role-policy_6FC89FB6



<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_appautoscaling_target.application_autoscaling_autoscaling_target_42BF5C99 will be updated in-place
  ~ resource "aws_appautoscaling_target" "application_autoscaling_autoscaling_target_42BF5C99" {
        id                 = "service/UserAPI-Prod/UserAPI-Prod"
      ~ max_capacity       = 30 -> 10
      ~ min_capacity       = 6 -> 2
        tags               = {}
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4 will be created
  + resource "aws_ecs_task_definition" "application_ecs_service_ecs-task_461CC9D4" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + environment            = [
                      + {
                          + name  = "DATABASE_READ_PORT"
                          + value = "3306"
                        },
                      + {
                          + name  = "DATABASE_WRITE_PORT"
                          + value = "3306"
                        },
                      + {
                          + name  = "EVENT_BUS_NAME"
                          + value = "PocketEventBridge-Prod-Shared-Event-Bus"
                        },
                      + {
                          + name  = "NODE_ENV"
                          + value = "production"
                        },
                    ]
                  + essential              = true
                  + healthCheck            = {
                      + command     = [
                          + "CMD-SHELL",
                          + "curl -f http://localhost:4006/.well-known/apollo/server-health || exit 1",
                        ]
                      + interval    = 15
                      + retries     = 3
                      + startPeriod = 0
                      + timeout     = 5
                    }
                  + image                  = "996905175585.dkr.ecr.us-east-1.amazonaws.com/userapi-prod-app:latest"
                  + logConfiguration       = {
                      + logDriver     = "awslogs"
                      + options       = {
                          + awslogs-group             = "/Backend/UserAPI-Prod/ecs/app"
                          + awslogs-multiline-pattern = "^\\S.+"
                          + awslogs-region            = "us-east-1"
                          + awslogs-stream-prefix     = "ecs"
                        }
                      + secretOptions = []
                    }
                  + mountPoints            = []
                  + name                   = "app"
                  + portMappings           = [
                      + {
                          + containerPort = 4006
                          + hostPort      = 4006
                          + protocol      = "tcp"
                        },
                    ]
                  + readonlyRootFilesystem = false
                  + secrets                = [
                      + {
                          + name      = "CHARACTER_MAP"
                          + valueFrom = "arn:aws:secretsmanager:us-east-1:996905175585:secret:Shared/IntMask:characterMap::"
                        },
                      + {
                          + name      = "CONTACT_HASH"
                          + valueFrom = "arn:aws:secretsmanager:us-east-1:996905175585:secret:Shared/IntMask:contactHash::"
                        },
                      + {
                          + name      = "DATABASE_READ_HOST"
                          + valueFrom = "arn:aws:secretsmanager:us-east-1:996905175585:secret:UserAPI/Prod/READITLA_DB:read_host::"
                        },
                      + {
                          + name      = "DATABASE_READ_PASSWORD"
                          + valueFrom = "arn:aws:secretsmanager:us-east-1:996905175585:secret:UserAPI/Prod/READITLA_DB:read_password::"
                        },
                      + {
                          + name      = "DATABASE_READ_USER"
                          + valueFrom = "arn:aws:secretsmanager:us-east-1:996905175585:secret:UserAPI/Prod/READITLA_DB:read_username::"
                        },
                      + {
                          + name      = "DATABASE_WRITE_HOST"
                          + valueFrom = "arn:aws:secretsmanager:us-east-1:996905175585:secret:UserAPI/Prod/READITLA_DB:write_host::"
                        },
                      + {
                          + name      = "DATABASE_WRITE_PASSWORD"
                          + valueFrom = "arn:aws:secretsmanager:us-east-1:996905175585:secret:UserAPI/Prod/READITLA_DB:write_password::"
                        },
                      + {
                          + name      = "DATABASE_WRITE_USER"
                          + valueFrom = "arn:aws:secretsmanager:us-east-1:996905175585:secret:UserAPI/Prod/READITLA_DB:write_username::"
                        },
                      + {
                          + name      = "LETTER_INDEX"
                          + valueFrom = "arn:aws:secretsmanager:us-east-1:996905175585:secret:Shared/IntMask:letterIndex::"
                        },
                      + {
                          + name      = "MD5_RANDOMIZER"
                          + valueFrom = "arn:aws:secretsmanager:us-east-1:996905175585:secret:Shared/IntMask:md5Randomizer::"
                        },
                      + {
                          + name      = "POSITION_MAP"
                          + valueFrom = "arn:aws:secretsmanager:us-east-1:996905175585:secret:Shared/IntMask:positionMap::"
                        },
                      + {
                          + name      = "SALT_1"
                          + valueFrom = "arn:aws:secretsmanager:us-east-1:996905175585:secret:Shared/IntMask:salt1::"
                        },
                      + {
                          + name      = "SALT_2"
                          + valueFrom = "arn:aws:secretsmanager:us-east-1:996905175585:secret:Shared/IntMask:salt2::"
                        },
                      + {
                          + name      = "SENTRY_DSN"
                          + valueFrom = "arn:aws:ssm:us-east-1:996905175585:parameter/UserAPI/Prod/SENTRY_DSN"
                        },
                    ]
                  + systemControls         = []
                  + volumesFrom            = []
                },
            ]
        )
      + cpu                      = "512"
      + execution_role_arn       = "arn:aws:iam::996905175585:role/UserAPI-Prod-TaskExecutionRole"
      + family                   = "UserAPI-Prod"
      + id                       = (known after apply)
      + memory                   = "2048"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = true
      + tags                     = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-userapi"
          + "costCenter"     = "Pocket"
          + "env_code"       = "prod"
          + "environment"    = "Prod"
          + "owner"          = "Pocket"
          + "service"        = "UserAPI"
        }
      + tags_all                 = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-userapi"
          + "costCenter"     = "Pocket"
          + "env_code"       = "prod"
          + "environment"    = "Prod"
          + "owner"          = "Pocket"
          + "service"        = "UserAPI"
        }
      + task_role_arn            = "arn:aws:iam::996905175585:role/UserAPI-Prod-TaskRole"
      + track_latest             = false
    }

  # aws_iam_policy.application_ecs_service_ecs-iam_ecs-task-execution-role-policy_2D469A77 will be updated in-place
  ~ resource "aws_iam_policy" "application_ecs_service_ecs-iam_ecs-task-execution-role-policy_2D469A77" {
        id               = "arn:aws:iam::996905175585:policy/UserAPI-Prod-TaskExecutionRolePolicy"
        name             = "UserAPI-Prod-TaskExecutionRolePolicy"
      ~ policy           = jsonencode(
          ~ {
              ~ Statement = [
                    {
                        Action   = [
                            "secretsmanager:GetSecretValue",
                            "kms:Decrypt",
                        ]
                        Effect   = "Allow"
                        Resource = [
                            "arn:aws:secretsmanager:us-east-1:996905175585:secret:UserAPI/Prod/*",
                            "arn:aws:secretsmanager:us-east-1:996905175585:secret:UserAPI/Prod",
                            "arn:aws:secretsmanager:us-east-1:996905175585:secret:UserAPI-Prod/*",
                            "arn:aws:secretsmanager:us-east-1:996905175585:secret:UserAPI-Prod",
                            "arn:aws:secretsmanager:us-east-1:996905175585:secret:Shared/*",
                            "arn:aws:secretsmanager:us-east-1:996905175585:secret:Shared",
                            "arn:aws:kms:us-east-1:996905175585:key/fee9bd90-a01f-4212-8b69-9c149a7cdb15",
                        ]
                    },
                  ~ {
                      ~ Resource = [
                            # (1 unchanged element hidden)
                            "arn:aws:ssm:us-east-1:996905175585:parameter/UserAPI/Prod",
                          - "arn:aws:ssm:us-east-1:996905175585:parameter/Shared/Prod/*",
                          - "arn:aws:ssm:us-east-1:996905175585:parameter/Shared/Prod",
                        ]
                        # (2 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        tags             = {
            "app_code"       = "pocket"
            "component_code" = "pocket-userapi"
            "costCenter"     = "Pocket"
            "env_code"       = "prod"
            "environment"    = "Prod"
            "owner"          = "Pocket"
            "service"        = "UserAPI"
        }
        # (7 unchanged attributes hidden)
    }

  # aws_iam_policy.application_ecs_service_ecs-iam_ecs-task-role-policy_6FC89FB6 will be updated in-place
  ~ resource "aws_iam_policy" "application_ecs_service_ecs-iam_ecs-task-role-policy_6FC89FB6" {
        id               = "arn:aws:iam::996905175585:policy/UserAPI-Prod-TaskRolePolicy"
        name             = "UserAPI-Prod-TaskRolePolicy"
      ~ policy           = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Action   = [
                          + "xray:PutTraceSegments",
                          + "xray:PutTelemetryRecords",
                          + "xray:GetSamplingTargets",
                          + "xray:GetSamplingStatisticSummaries",
                          + "xray:GetSamplingRules",
                            "logs:PutLogEvents",
                            # (4 unchanged elements hidden)
                        ]
                        # (2 unchanged attributes hidden)
                    },
                    {
                        Action   = "events:PutEvents"
                        Effect   = "Allow"
                        Resource = "arn:aws:events:us-east-1:996905175585:event-bus/PocketEventBridge-Prod-Shared-Event-Bus"
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        tags             = {
            "app_code"       = "pocket"
            "component_code" = "pocket-userapi"
            "costCenter"     = "Pocket"
            "env_code"       = "prod"
            "environment"    = "Prod"
            "owner"          = "Pocket"
            "service"        = "UserAPI"
        }
        # (7 unchanged attributes hidden)
    }

Plan: 1 to add, 3 to change, 0 to destroy.

Changes to Outputs:
  ~ ecs-task-arn           = "arn:aws:ecs:us-east-1:996905175585:task-definition/UserAPI-Prod:643" -> (known after apply)
```

</details>









<!-- github-comment: {"Command":"plan","JobName":"plan","PRNumber":799,"Program":"tfcmt","SHA1":"5f5d53243ec7a1303770683511f452727367bc75","Target":"user-api-cdk-production","Vars":{},"WorkflowName":"User API"} -->